from tkinter import Tk, Button, Frame, StringVar
from tkinter.ttk import Combobox


options = {
    'Береговая':['36','38','40','42Б','44','46'],
    'Дружбы':['1','1А','1Б','1Г','19','96','98','100','102','104','106','108','108А','112','114','114А','116','118','120Б','124','132','136','138','142','144'],
    'Маяковского':['7','9','19','21','23'],
    'Мичурина':['1','1Б','2','2Б','3','4','5','6','7','8','9','11','12','13','14','16','17','18','19','20'],
    'Парковая':['1','2А','3','6','8'],
    'Пархоменко':['1','1А','3','3А','5','5А'],
    'Советской Армии':['20'],
    'Советская':['1А','40','42','43А','45','46','52','53'],
    'Строителей':['1А','1','2А','2','3','5','6','7','9'],
    'Сурикова':['3','5','7','8','9','10','11','12','13','14','15','24','26','28','30'],
    'Центральная':['8Б','42','45','46','47','48','50','51','53','55','56','57','58','59','61','63','65','67'],
    'Ленина':['12'],
    'Солнечная':['3','6','8','10','12','18','20'],
    'Нестерова':['12','14','16','18','20'],
    'Тургенева':['1','2','3','6','7','8','9','10','11','12','14'],
    'Чкалова':['19'],
    'Октябрьская': ['4', '5', '6', '7', '8', '9', '10'],
    'Олейникова': ['64'],
    'Горького':['15','17'],
    'Дзержинского':['17','38'],
    'Калинина':['1','2','3'],
    'Полевая':['2А','70','72'],
    'Юбилейный': ['2', '4'],
    'Юности': ['5'],
    'Заводская': ['55']
}


def get_var_1(event):
    value = cb1_var.get()
    cb2_var.set(options[value][0])
    cb2.config(values=options[value])


def get_info():
    print(cb1_var.get(), cb2_var.get())


root = Tk()

cb_frame = Frame(root)
cb_frame.pack(side='left')

cb1_values = list(options.keys())

cb1_var = StringVar()
cb1_var.set(cb1_values[0])
cb1 = Combobox(cb_frame, values=list(options.keys()), textvariable=cb1_var)
cb1.pack(side='top')
cb1.bind('<<ComboboxSelected>>', get_var_1)


cb2_var = StringVar()
cb2_var.set(options[cb1_values[0]][0])
cb2 = Combobox(cb_frame, values=options[cb1_values[0]], textvariable=cb2_var)
cb2.pack(side='bottom')


btn_frame = Frame(root)
btn_frame.pack(side='right')
Button(btn_frame, text='Confirm', command=get_info).pack()


root.mainloop()