#HOUSING FUND
OOO_CKY_RAZVITYE = {
    'Береговая':['36','38','40','42Б','44','46'],
    'Дружбы':['1','1А','1Б','1Г','19'],
    'Маяковского':['9','19','21','23'],
    'Мичурина':['1Б','2Б'],
    'Парковая':['2А'],
    'Пархоменко':['1А'],
    'Советской Армии':['20'],
    'Советская':['1А','43А','45','46'],
    'Строителей':['1А','2А'],
    'Сурикова':['8','10','12','14','24','26','28','30'],
    'Центральная':['42','58'],
    'Чкалова':['19'],
    'Полевая':['70','72']
}
OOO_BSK_PLUS = {
    'Мичурина':['1','2','3','4','5','6','7','8','9','11','12','13','14','16','17','18','19','20',],
    'Сурикова':['9','11','13','15'],
    'Тургенева':['1','2','3','6','7','8','9','10','11','12','14'],
    'Ленина':['12'],
    'Маяковского':['7'],
    'Нестерова':['12','14','16','18','20'],
    'Пархоменко':['1','3','3А','5','5А'],
    'Советская':['42'],
    'Солнечная':['3','6','18','20'],
    'Строителей':['6'],
    'Центральная':['8Б','46','56','65']
}
OOO_KONCEPT = {
    'Парковая':['1','3','6','8'],
    'Центральная':['45','47','48','50','51','53','55','57','59','61','63','67'],
    'Дзержинского':['17','38'],
    'Горького':['15','17'],
    'Полевая':['2А'],
    'Калинина':['1','2','3'],
    'Октябрьская':['4','5','6','7','8','9','10'],
    'Олейникова':['64'],
    'Советская':['40','52','53'],
    'Солнечная':['8','10','12'],
    'Строителей':['1','2','3','5','7','9'],
    'Сурикова':['3','5','7'],
    'Юбилейный':['2','4'],
    'Юности':['5'],
    'Дружбы':['96','98','100','102','104','106','108','108А','112','114','114А','116','118','120Б','124','132','136','138','142','144'],
    'Заводская':['55']
}


#JURISDICTION OF THE COURT
JUDICIAL_PRECINCT_9 = ['Белинского', 'Горького', 'Заводская', 'Калинина', 'Маяковского', 'Мичурина',
                       'Нестерова', 'Октябрьская', 'Советской Армии', 'Сурикова', 'Солнечная',
                       'Тургенева',{'Дружбы':['1', '1А', '1Б', '1Г', '19']}]

JUDICIAL_PRECINCT_8 = []



NAME_OF_THE_CLAIMANT = ['ООО "СКУ Развитие"' if ___ in OOO_CKY_RAZVITYE
                        else ('ООО "БСК Плюс"' if ___ in OOO_BSK_PLUS else 'ООО "Концепт"')]

ADDRESS_OF_THE_CLAIMANT = ['662520 Красноярский край, Березовский район, п. Березовка ул. Юности, пом. 2 каб. 2'
                            if ___ in OOO_CKY_RAZVITYE
                            else '662520 Красноярский край, Березовский район, п. Березовка ул. Юности, д. 19/2']

MANAGEMENT_START_DATE = ['2019' if ___ in OOO_CKY_RAZVITYE else '2020']

COURT_NUMBER = ['Мировому судье судебного участка №9 в Березовском районе Красноярского края Пашковскому А.Д.'
                if ADDRESS_NAME in JUDICIAL_PRECINCT_9
                else 'Мировому судье судебного участка №8 в Березовском районе Красноярского края Белявцевой Е.А.']

